Revit 2026 API

# StairsGetStairsSupports Method

---

Returns all the stairs support components in the stairs.

**Namespace:** Autodesk.Revit.DB.Architecture**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public ICollection<ElementId> GetStairsSupports()
```
```vb
Public Function GetStairsSupports As ICollection(Of ElementId)
```
```cpp
public:
ICollection<ElementId^>^ GetStairsSupports()
```
```fsharp
member GetStairsSupports : unit -> ICollection<ElementId>
```

#### Return Value

ICollectionElementId

#### Reference

Stairs Class

Autodesk.Revit.DB.Architecture Namespace